trade/src/InformationRegisters/СтатусыПубликацииТоваровЯндексМаркет/СтатусыПубликацииТоваровЯндексМаркет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыПубликацииТоваровЯндексМаркет</name>
  <resources>
    <name>УдалитьИдентификаторПубликации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторПредложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыВыгрузкиТоваровЯндексМаркет</types>
    </type>
  </resources>
  <resources>
    <name>Выбран</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПредставлениеТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторТовараПлощадки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТовараПлощадки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКатегорииПлощадки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеМоделиПлощадки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГиперссылкаНаРекомендованныеТовар</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаПродажи</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>МаркерСтатуса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьИдентификаторПлощадки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстановкиЦены</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокВУпаковках</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураПартнера</name>
    <type>
      <types>CatalogRef.НоменклатураКонтрагентов</types>
    </type>
  </attributes>
  <dimensions>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/InformationRegisters/ОстаткиТоваровМаркетплейсов/ОстаткиТоваровМаркетплейсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОстаткиТоваровМаркетплейсов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаВыгрузкиОстатков</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>УчетнаяЗаписьМаркетплейса</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/InformationRegisters/ОтносительныеКурсыВалют/ОтносительныеКурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтносительныеКурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КурсЧислитель</name>
    <type>
      <types>DefinedType.КурсВалюты</types>
    </type>
  </resources>
  <resources>
    <name>КурсЗнаменатель</name>
    <type>
      <types>DefinedType.КурсВалюты</types>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БазоваяВалюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/Enums/СтатусыВыгрузкиТоваровЯндексМаркет/СтатусыВыгрузкиТоваровЯндексМаркет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыВыгрузкиТоваровЯндексМаркет</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>ПолученаРекомендация</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаПриПолученииРекомендации</name>
  </enumValues>
  <enumValues>
    <name>РекомендацияНеНайдена</name>
  </enumValues>
  <enumValues>
    <name>УтвержденаРекомендация</name>
  </enumValues>
  <enumValues>
    <name>НаМодерации</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаПриОтправкеНаМодерацию</name>
  </enumValues>
  <enumValues>
    <name>МодерацияПройдена</name>
  </enumValues>
  <enumValues>
    <name>МодерацияНеПройдена</name>
  </enumValues>
  <enumValues>
    <name>НевернаяРекомендация</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетМодерации</name>
  </enumValues>
  <enumValues>
    <name>СозданиеНового</name>
  </enumValues>
</mdclass:Enum>

trade/src/Catalogs/УчетныеЗаписиМаркетплейсов/УчетныеЗаписиМаркетплейсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчетныеЗаписиМаркетплейсов</name>
  <attributes>
    <name>ВидМаркетплейса</name>
    <type>
      <types>EnumRef.ВидыМаркетплейсов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникКатегории</name>
    <type>
      <types>EnumRef.ИсточникиКатегорийДляМаркетплейса</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаУчета</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешНастроек</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеОбновлятьДанныеТорговойПлощадки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПродажиЧерезСкладыТорговойПлощадки</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПродажиЧерезСкладыСобственные</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторМагазина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторАккаунта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СхемаРаботы</name>
    <type>
      <types>EnumRef.СхемыРаботыТорговыхПлощадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКабинета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыЦен</name>
    <attributes>
      <name>ИмяНастройки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеНастройки</name>
    <attributes>
      <name>ИдентификаторНастройки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеНастройки</name>
      <type>
        <types>Boolean</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеНастройкиСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеНастройкиСсылка</name>
      <comment>Состав типов реквизита дополняется по мере необходимости</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
        <types>CatalogRef.ПричиныОтменыЗаказовКлиентов</types>
        <types>CatalogRef.СоглашенияСКлиентами</types>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.Партнеры</types>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade/src/Catalogs/ХарактеристикиНоменклатуры/ХарактеристикиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХарактеристикиНоменклатуры</name>
  <owners>Catalog.ВидыНоменклатуры</owners>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Принципал</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаНоменклатурыДляЦенообразования</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатурыДляЦенообразования</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПолное</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade/src/InformationRegisters/СтатусыПубликацииТоваровЯндексМаркет/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЭтаНовая = ЭтоНоваяЗапись();
	ИнициироватьПодсказки();

	Если ЭтаНовая Тогда
		Запись.ИдентификаторПредложения = Строка(Новый УникальныйИдентификатор());
		Если Параметры.Свойство("УчетнаяЗапись") Тогда
			Запись.УчетнаяЗапись = Параметры.УчетнаяЗапись;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования.Номенклатура) Тогда
			Запись.Статус        = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.ПустаяСсылка();
			Запись.МаркерСтатуса = 0;
			Модифицированность   = Истина;
		КонецЕсли;
		
		Элементы.Статус.Видимость = Ложь;
		Элементы.ГруппаЕслиСоздание.Видимость = Истина;
		Элементы.Номенклатура.ТолькоПросмотр = Ложь;
		Элементы.Характеристика.ТолькоПросмотр = Ложь;
		Элементы.Упаковка.ТолькоПросмотр = Ложь;
		
	Иначе
		Элементы.Статус.Видимость = Истина;
		Элементы.ГруппаЕслиСоздание.Видимость = Ложь;
		Элементы.Номенклатура.ТолькоПросмотр = Истина;
		Элементы.Характеристика.ТолькоПросмотр = Истина;
		Элементы.Упаковка.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Элементы.ИдентификаторПредложения.ТолькоПросмотр = НЕ ДоступноИзменениеИдентификатора();

	Если ЗначениеЗаполнено(Запись.ПредставлениеТовара) Тогда
		Заголовок = Запись.ПредставлениеТовара;  
	КонецЕсли;	
	Элементы.Статус.ЦветТекста = ПолучитьЦветТекстаПоМаркеру();
	ИнициализироватьСтраницы();
	ИнициализироватьХарактеристикиПоВидуНоменклатуры();
	ОбновитьДопИнфо();
	
	ПредыдущийСтатус = Запись.Статус;

КонецПроцедуры

&НаСервере
Функция ДоступноИзменениеИдентификатора()  
	
	ДоступноИзменениеИдентификатора = Ложь;
	
	Если Запись.Статус = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.ПустаяСсылка()
			Или Запись.Статус = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.Новый
			Или Запись.Статус = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.СозданиеНового
			Или Запись.Статус = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.ПолученаРекомендация
			Или Запись.Статус = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.ОшибкаПриПолученииРекомендации
			Или Запись.Статус = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.НевернаяРекомендация
			Или Запись.Статус = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.РекомендацияНеНайдена
			Или Запись.Статус = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.УтвержденаРекомендация Тогда  
			
		ДоступноИзменениеИдентификатора = Истина;
		
	КонецЕсли;
	
	Возврат ДоступноИзменениеИдентификатора;
	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Запись.Номенклатура) Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Заполните поле ""Номенклатура"".'"));
	КонецЕсли;
	
	СтруктураЗаписи = Новый Структура("УчетнаяЗапись, Номенклатура, Характеристика, Упаковка, Статус");
	ЗаполнитьЗначенияСвойств(СтруктураЗаписи, Запись);
	Если ЭтоНоваяЗапись() И ЗаписьСуществует(СтруктураЗаписи) Тогда
		ОчиститьСообщения();
		Отказ = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Товар уже существует в списке публикации.'"));
	КонецЕсли;
	
	Результат = ИдентификаторПредложенияНеУникален(Запись.ИдентификаторПредложения);
	ЭтоНоваяЗапись = ЭтоНоваяЗапись();
	ДоступноИзменениеИдентификатора = Ложь; 
	
	Если (ЭтоНоваяЗапись ИЛИ ДоступноИзменениеИдентификатора()) И Результат.ИдентификаторПредложенияНеУникален Тогда    
		Отказ = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Введенный идентификатор предложения уже используется для товара - %1 в магазине  - %2.
																	    |Укажите другой идентификатор.'"),Результат.ПредставлениеТовара,Результат.УчетнаяЗапись));      
	КонецЕсли;
	
	Если ЭтоНоваяЗапись Тогда
		ЗаполнитьСвойстваЗаписи();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПослеЗаписиНаСервере();
	
	Оповестить("Запись_СтатусыПубликацииТоваровЯндексМаркет", 
		Запись.УчетнаяЗапись, 
		Запись);

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере()
	
	Если Запись.Статус = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.МодерацияПройдена
			И Запись.Статус <> ПредыдущийСтатус Тогда
		РегистрыСведений.ОстаткиТоваровМаркетплейсов.ОчиститьЗаписиПоНоменклатуреИХарактеристике(
			Запись.УчетнаяЗапись, 
			Запись.Номенклатура,
			Запись.Характеристика);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияЯНеЗнаюНажатие(Элемент)

	Элементы.ПодсказкаЯНеЗнаюSKU.Видимость = Не Элементы.ПодсказкаЯНеЗнаюSKU.Видимость;
	Если Элементы.ПодсказкаЯНеЗнаюSKU.Видимость Тогда
		Элементы.ПодсказкаЯЗнаюSKU.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЯЗнаюSKUНажатие(Элемент)

	Элементы.ПодсказкаЯЗнаюSKU.Видимость = Не Элементы.ПодсказкаЯЗнаюSKU.Видимость;
	Если Элементы.ПодсказкаЯЗнаюSKU.Видимость Тогда
		Элементы.ПодсказкаЯНеЗнаюSKU.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПерейтиПоСсылкеНажатие(Элемент)

	Если ЗначениеЗаполнено(Запись.ГиперссылкаНаРекомендованныеТовар) Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(СокрЛП(Запись.ГиперссылкаНаРекомендованныеТовар));
	Иначе
		ОчиститьСообщения();
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Заполните поле ""Гиперссылка на пример товара""'"));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)

	ОбновитьПредставлениеТовара();
	ОбновитьОтображениеДанных();
	ИнициализироватьХарактеристикиПоВидуНоменклатуры();

КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикаПриИзменении(Элемент)

	ОбновитьПредставлениеТовара();
	ОбновитьОтображениеДанных();

КонецПроцедуры

&НаКлиенте
Процедура УпаковкаПриИзменении(Элемент)

	ОбновитьПредставлениеТовара();
	ОбновитьОтображениеДанных();

КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторПредложенияПриИзменении(Элемент)
	
	ОчиститьСообщения();
	
	Результат = ИдентификаторПредложенияНеУникален(Запись.ИдентификаторПредложения);
	
	Если Результат.ИдентификаторПредложенияНеУникален Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Введенный идентификатор предложения уже используется для товара - %1 в магазине  - %2.
																		|Укажите другой идентификатор.'"),Результат.ПредставлениеТовара,Результат.УчетнаяЗапись));      
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьНаМодерацию(Команда)

	ОбработатьРекомендацию(Команда.Имя);

КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьРекомендацию(Команда)

	ОбработатьРекомендацию(Команда.Имя);

КонецПроцедуры

&НаКлиенте
Процедура УтвердитьРекомендацию(Команда)

	ОбработатьРекомендацию(Команда.Имя);

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьРекомендацию(Команда)
	
	ОбработатьРекомендацию(Команда.Имя);

КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВБуферОбменаИдентификаторПредложения(Команда)

	СкопироватьВБуферОбмена(Запись.ИдентификаторПредложения);
	
КонецПроцедуры  

&НаКлиенте
Процедура ОбновитьДанныеТовара(Команда)
	
	ОбновитьПредставлениеТовара();
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьЦветТекстаПоМаркеру()
	
	Если Запись.МаркерСтатуса = 0 Тогда
		
		Цвет = ЦветаСтиля.ЦветОсобогоТекста;
		
	ИначеЕсли Запись.МаркерСтатуса = 1 Тогда
		
		Цвет = ЦветаСтиля.ЦветАктивности;
		
	ИначеЕсли Запись.МаркерСтатуса = 2 Тогда
		
		Цвет = ЦветаСтиля.ЦветПустойГиперссылки;
		
	ИначеЕсли Запись.МаркерСтатуса = 3 Тогда 
		
		Цвет = ЦветаСтиля.ЦветАкцента;
		
	КонецЕсли;
	
	Возврат Цвет;
			
КонецФункции

&НаСервере
Процедура ИнициализироватьСтраницы()
	
	Элементы.СтраницаДанныеСвязи.ТолькоПросмотр = Ложь;
	Элементы.СтраницаДанныеТовара.ТолькоПросмотр = Ложь;
	Элементы.СообщениеОНедоступности.Видимость = Ложь;
	Элементы.СтраницаОписаниеОшибки.Видимость = Ложь;
	
	Если Запись.Статус = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.НаМодерации
			Или Запись.Статус = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.МодерацияПройдена Тогда
			 
		Элементы.СтраницаДанныеСвязи.ТолькоПросмотр = Истина;
		Элементы.СтраницаДанныеТовара.ТолькоПросмотр = Истина;
		Элементы.СообщениеОНедоступности.Видимость = Истина;
		Элементы.ПолучитьРекомендацию.Видимость = Ложь;
		Элементы.ОтправитьНаМодерацию.Видимость = Ложь;
		Элементы.УтвердитьРекомендацию.Видимость = Ложь;
		Элементы.ОтклонитьРекомендацию.Видимость = Ложь;
		Элементы.ОбновитьДанныеТовара.Видимость = Ложь;
	
	ИначеЕсли Запись.Статус = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.ПолученаРекомендация Тогда
		
		Элементы.ПолучитьРекомендацию.Видимость = Ложь;
		Элементы.ОтправитьНаМодерацию.Видимость = Ложь;
		Элементы.УтвердитьРекомендацию.Видимость = Ложь;
		Элементы.ОтклонитьРекомендацию.Видимость = Ложь;
		Элементы.ОбновитьДанныеТовара.Видимость = Ложь;
	
	Иначе
		
		Элементы.ПолучитьРекомендацию.Видимость = Ложь;
		Элементы.ОтправитьНаМодерацию.Видимость = Истина;
		Элементы.УтвердитьРекомендацию.Видимость = Ложь;
		Элементы.ОтклонитьРекомендацию.Видимость = Ложь;
		Элементы.ОбновитьДанныеТовара.Видимость = Истина;
	
	КонецЕсли;

	Если Запись.МаркерСтатуса = 0 
			И Не Запись.Статус = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.ПустаяСсылка() Тогда //красный
		
	     Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОписаниеОшибки;
		 Элементы.СтраницаОписаниеОшибки.Видимость = Истина;
		
	ИначеЕсли Запись.МаркерСтатуса = 1 Тогда //желтый
		
	     Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаДанныеСвязи;
		 		
	ИначеЕсли Запись.МаркерСтатуса = 2 Тогда //серый
		
	     Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаДанныеТовара;
		
	ИначеЕсли Запись.МаркерСтатуса = 3 
				Или Запись.Статус = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.ПустаяСсылка() Тогда //зеленый
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаДанныеТовара;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ИнициироватьПодсказки()
	
	Элементы.ПодсказкаЯЗнаюSKU.Заголовок = НСтр("ru = 'Если Вы уже знаете SKU товара на Маркете, заполните информацию на закладке ""Данные связи"" и отправьте товар на модерацию (кнопка ""Отправить на модерацию"").'");
	Элементы.ПодсказкаЯНеЗнаюSKU.Заголовок = 
		НСтр("ru = 'Попробуйте найти товар в поиске по разделу ""Покупки"" на Маркете. Если товар найдется, SKU на Яндексе можно взять из URL его страницы.
					|Например, если URL страницы товара:
					|https://market.yandex.ru/product--pir-2821ak/649875256?sponsored=1&sku=100848394231
					|то его SKU на Яндексе — 100848394231.
					|Если вы смогли самостоятельно подобрать SKU на Яндексе - заполните его и отправьте товар на модерацию (кнопка ""Отправить на модерацию"").
					|Если SKU не удалось подобрать - наиболее подробно опишите товар и отправьте товар на модерацию без указания SKU (кнопка ""Отправить на модерацию"") - сотрудники Маркета могут подобрать или создать карточки для ваших товаров в личном кабинете, если товар еще не продается на Маркете.'");
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьХарактеристикиПоВидуНоменклатуры()
	
	Если Не ЭтоНоваяЗапись() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.Номенклатура) Тогда
		Элементы.Характеристика.ТолькоПросмотр = Истина;
		Элементы.Упаковка.ТолькоПросмотр       = Истина;
		Возврат;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры")
		И Справочники.Номенклатура.ХарактеристикиИспользуются(Запись.Номенклатура) Тогда 
		Элементы.Характеристика.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.Характеристика.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Элементы.Упаковка.ТолькоПросмотр = Не ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры");
	
КонецПроцедуры

&НаСервере
Функция ЭтоНоваяЗапись()

	Возврат Не ЗначениеЗаполнено(Параметры.Ключ.Номенклатура);

КонецФункции

&НаКлиенте
Процедура ОбработатьРекомендацию(ИмяКоманды)
	
	ОчиститьСообщения();
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяКоманды", ИмяКоманды);
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьРекомендациюЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	Если Модифицированность Тогда
		ТекстВопроса = НСтр("ru = 'Требуется сохранение измененных данных. Продолжить?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
		
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРекомендациюЗавершение(Результат, ДополнительныеПараметры = Неопределено) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		Если Не ЗначениеЗаполнено(Запись.Номенклатура) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Заполните поле ""Номенклатура"".'"));
			Возврат;
		КонецЕсли;
		
		СтруктураЗаписи = Новый Структура("УчетнаяЗапись, Номенклатура, Характеристика, Упаковка, Статус");
		ЗаполнитьЗначенияСвойств(СтруктураЗаписи, Запись);
		
		Если ЭтоНоваяЗапись() И ЗаписьСуществует(СтруктураЗаписи) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Товар уже существует в списке публикации.'"));
			Возврат;
		КонецЕсли;
	
		Если ДополнительныеПараметры.ИмяКоманды = "ОтправитьНаМодерацию" Тогда
			ОтправитьНаМодерациюНаСервере();
		ИначеЕсли ДополнительныеПараметры.ИмяКоманды = "ОтклонитьРекомендацию" Тогда
			ОтклонитьРекомендациюНаСервере();
		ИначеЕсли ДополнительныеПараметры.ИмяКоманды = "УтвердитьРекомендацию" Тогда
			УтвердитьРекомендациюНаСервере();
		ИначеЕсли ДополнительныеПараметры.ИмяКоманды = "ПолучитьРекомендацию" Тогда
			ПолучитьРекомендациюНаСервере();
		КонецЕсли;

		Оповестить("Запись_СтатусыПубликацииТоваровЯндексМаркет", 
			Запись.УчетнаяЗапись, 
			Запись);
			
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаМодерациюНаСервере()
	
	Запись.Статус = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.УтвержденаРекомендация;
	Записать();
	
КонецПроцедуры

&НаСервере
Процедура ОтклонитьРекомендациюНаСервере()
	
	Запись.Статус         = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.НевернаяРекомендация;
	Запись.ОписаниеОшибки =
		"Если товар определен неправильно:
		|Проверьте, что товар относится к одной из категорий, представленных на Маркете.
		|Убедитесь, что предоставили наиболее полные и точные данные о товаре.
		|Если не указана какая-либо информация, уточните входные данные запроса (например, добавьте цвет или размер в характеристики товара или добавьте описание модели, скорректировав данные в поле ""Представление"" на закладке ""Данные о товаре"", укажите базовую цену товара, если она не заполнена).
		|После заполнения данных отправьте повторно публикацию на получение рекомендации (кнопка ""Получить рекомендацию"").
		|Попробуйте найти товар в поиске по разделу «Покупки» на Маркете. Если товар найдется, SKU на Яндексе можно взять из URL его страницы. Например, если URL страницы товара — https://market.yandex.ru/product--pir-2821ak/649875256?sponsored=1&sku=100848394231, то его SKU на Яндексе — 100848394231.Если советы не помогли - отправьте информацию о товаре без SKU на Яндексе (кнопка ""Отправить на модерацию"") - сотрудники Маркета могут подобрать или создать карточки для ваших товаров в личном кабинете, если товар еще не продается на Маркете.";
	Записать();

КонецПроцедуры

&НаСервере
Процедура УтвердитьРекомендациюНаСервере()

	Запись.Статус = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.УтвержденаРекомендация;
	Записать();

КонецПроцедуры

&НаСервере
Процедура ПолучитьРекомендациюНаСервере()

	Запись.Статус = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.Новый;
	Записать();

КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставлениеТовара()

	Характеристика = "";
	Упаковка       = "";
	
	Если ЗначениеЗаполнено(Запись.Номенклатура) Тогда
		Если Не ЗначениеЗаполнено(Запись.Упаковка) Тогда
			Запись.Упаковка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Номенклатура, "ЕдиницаИзмерения");
		КонецЕсли;

		Номенклатура        = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Запись.Номенклатура, "Наименование");
		Характеристика      = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Запись.Характеристика, "Наименование");
		Упаковка            = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Запись.Упаковка, "Наименование");
		ПредставлениеТовара = Номенклатура.Наименование;
		Если ЗначениеЗаполнено(Характеристика.Наименование) Тогда
			ПредставлениеТовара = ПредставлениеТовара + ", " + Характеристика.Наименование;
		КонецЕсли;
		Если ЗначениеЗаполнено(Упаковка.Наименование) Тогда
			ПредставлениеТовара = ПредставлениеТовара + ", " + Упаковка.Наименование;
		КонецЕсли;
		
		Запись.ПредставлениеТовара = ПредставлениеТовара;
		Запись.ТоварнаяКатегория   = ИнтеграцияСЯндексМаркетСервер.КатегорияТовара(Запись.Номенклатура,Запись.УчетнаяЗапись);
		ПолучитьЦену(ИнтеграцияСЯндексМаркетСервер.ДанныеУчетнойЗаписиЯндексМаркет(Запись.УчетнаяЗапись, Ложь));
		Запись.ЦенаПродажи = Цена;
		
	Иначе
		Запись.ПредставлениеТовара = "";
		Запись.ТоварнаяКатегория   = "";
		Запись.ЦенаПродажи         = 0;
	КонецЕсли;
		
	ОбновитьДопИнфо();

КонецПроцедуры

&НаСервере
Процедура ПолучитьЦену(ДанныеУчетнойЗаписи)
			
	ТекстЗапроса = "ВЫБРАТЬ
	|	ВЫРАЗИТЬ(&УчетнаяЗапись КАК Справочник.УчетныеЗаписиМаркетплейсов) КАК УчетнаяЗапись,
	|	ВЫРАЗИТЬ(&Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(&Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	|	ВЫРАЗИТЬ(&Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения) КАК Упаковка
	|ПОМЕСТИТЬ ВТ_Товары     
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	УчетнаяЗапись,
	|	Номенклатура,
	|	Характеристика,
	|	Упаковка   
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтносительныеКурсыВСрезПоследних.Валюта КАК Валюта,
	|	ОтносительныеКурсыВСрезПоследних.КурсЧислитель КАК КурсЧислитель,
	|	ОтносительныеКурсыВСрезПоследних.КурсЗнаменатель КАК КурсЗнаменатель
	|ПОМЕСТИТЬ КурсыВалют
	|ИЗ
	|	РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(, БазоваяВалюта = &БазоваяВалюта) КАК ОтносительныеКурсыВСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.УчетнаяЗапись КАК УчетнаяЗапись,
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.Характеристика КАК Характеристика, 
	|	ВЫБОР
	|		КОГДА ВТ_Товары.Упаковка = СправНоменклатура.ЕдиницаИзмерения
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|		ИНАЧЕ ВТ_Товары.Упаковка
	|	КОНЕЦ КАК Упаковка,
	|	ВЫРАЗИТЬ(ВТ_Товары.Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения) КАК УпаковкаТовара,
	|	&ВидЦен КАК ВидЦены,
	|	&ПоляДляЦенообразованияВыборка КАК ПоляДляЦенообразованияВыборка
	|ПОМЕСТИТЬ ТаблицаТоварныхПозиций   
	|
	|ИЗ 
	|	ВТ_Товары КАК ВТ_Товары
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправНоменклатура 
	|		ПО ВТ_Товары.Номенклатура = СправНоменклатура.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|			ПО СправНоменклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка	
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	ПоляДляЦенообразованияВыборка,
	|	ВидЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|	&ПоляДляЦенообразованияСрез КАК ПоляДляЦенообразованияСрез,
	|	ЦеныНоменклатуры.Цена КАК Цена,
	|	ЦеныНоменклатуры.Упаковка КАК Упаковка,
	|	ЦеныНоменклатуры.Валюта КАК Валюта,
	|	ЦеныНоменклатуры.Период КАК Период
	|ПОМЕСТИТЬ ЦеныНоменклатуры
	|ИЗ
	|	ИсточникЦенНоменклатуры КАК ЦеныНоменклатуры
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	ПоляДляЦенообразованияСрез
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	ТаблицаТоварныхПозиций.УчетнаяЗапись КАК УчетнаяЗапись,
	|	ТаблицаТоварныхПозиций.Номенклатура КАК Номенклатура,
	|	ТаблицаТоварныхПозиций.Характеристика КАК Характеристика,
	|	ТаблицаТоварныхПозиций.УпаковкаТовара КАК Упаковка,
	|	ЦеныНоменклатуры.Период КАК Период,
	|	&ЦенаПродажи КАК Цена
	|ИЗ
	|	ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправНоменклатура
	|		ПО ЦеныНоменклатуры.Номенклатура = СправНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсыВалют
	|		ПО ЦеныНоменклатуры.Валюта = КурсыВалют.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсыВалютУчета
	|		ПО (КурсыВалютУчета.Валюта = &БазоваяВалюта)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТоварныхПозиций КАК ТаблицаТоварныхПозиций
	|		ПО (&УсловиеСоединенияЦеныНоменклатурыСрезПоследних)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Товары
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ КурсыВалют
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаТоварныхПозиций
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ЦеныНоменклатуры";

	ТекущаяДата                   = ТекущаяДатаСеанса();
	ИспользуетсяЦенообразование25 = ЦенообразованиеВызовСервера.ИспользуетсяЦенообразование25(ТекущаяДата);
	
	НастройкаЦенообразования                 = ЦенообразованиеКлиентСервер.НастройкиДляВременнойТаблицыСДополнениемДляЦенообразования();
	НастройкаЦенообразования.ИсточникТоваров = "ВТ_Товары";
	НастройкаЦенообразования.ПолеСерия       = "";

	ТекстЗамены = ЦенообразованиеКлиентСервер.ТекстПолейДляЦенообразования(НастройкаЦенообразования);
	Если ЗначениеЗаполнено(ТекстЗамены) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляДляЦенообразованияВыборка КАК ПоляДляЦенообразованияВыборка", ТекстЗамены);
		ПоляДляЦенообразования =
			"ХарактеристикаЦО,
			|	СерияЦО,
			|	УпаковкаЦО";
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляДляЦенообразованияВыборка КАК ПоляДляЦенообразованияВыборка", "ИСТИНА");
		ПоляДляЦенообразования =
			"Характеристика";
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПоляДляЦенообразованияВыборка", ПоляДляЦенообразования);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"ИсточникЦенНоменклатуры",
		ЦенообразованиеКлиентСервер.ТекстЗапросаРегистрСведенийЦеныНоменклатуры("ТаблицаТоварныхПозиций",
			"&ДатаЦен",
			Новый Структура("ВТаблице", "ВидЦены"),
			ИспользуетсяЦенообразование25));

	Если ИспользуетсяЦенообразование25 Тогда
		ПоляДляЦенообразованияСрез = 
			"ЦеныНоменклатуры.ХарактеристикаЦО КАК ХарактеристикаЦО,
			|	ЦеныНоменклатуры.СерияЦО КАК СерияЦО,
			|	ЦеныНоменклатуры.УпаковкаЦО КАК УпаковкаЦО";
	Иначе
		ПоляДляЦенообразованияСрез = 
			"ЦеныНоменклатуры.Характеристика КАК Характеристика";
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляДляЦенообразованияСрез КАК ПоляДляЦенообразованияСрез", ПоляДляЦенообразованияСрез);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПоляДляЦенообразованияСрез", ПоляДляЦенообразования);

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&УсловиеСоединенияЦеныНоменклатурыСрезПоследних",
		ЦенообразованиеКлиентСервер.ТекстЗапросаРегистрСведенийЦеныНоменклатурыУсловиеСоединения(
			"ТаблицаТоварныхПозиций",
			"ЦеныНоменклатуры",,
			ИспользуетсяЦенообразование25));

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&ЦенаПродажи",
		"ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) 
		|			* ВЫБОР
		|				КОГДА ТаблицаТоварныхПозиций.Упаковка <> ЦеныНоменклатуры.Упаковка
		|					ТОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) 
		|							/ ВЫБОР
		|								КОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1) = 0
		|									ТОГДА 1
		|								ИНАЧЕ ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1)
		|							КОНЕЦ
		|				ИНАЧЕ 1
		|			КОНЕЦ 
		|			* ВЫБОР
		|				КОГДА ЦеныНоменклатуры.Валюта = &БазоваяВалюта
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(КурсыВалют.КурсЧислитель, 1) * ЕСТЬNULL(КурсыВалютУчета.КурсЗнаменатель, 1) / (ЕСТЬNULL(КурсыВалютУчета.КурсЧислитель, 1) * ЕСТЬNULL(КурсыВалют.КурсЗнаменатель, 1))
		|			КОНЕЦ КАК ЧИСЛО(31, 2))");

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&ТекстЗапросаКоэффициентУпаковки1",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"(ВЫБОР
			|	КОГДА ТаблицаТоварныхПозиций.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
			|		ТОГДА СправНоменклатура.ЕдиницаИзмерения
			|	ИНАЧЕ ТаблицаТоварныхПозиций.Упаковка
			|КОНЕЦ)",
			"ТаблицаТоварныхПозиций.Номенклатура"));

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&ТекстЗапросаКоэффициентУпаковки2",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"(ВЫБОР
			|	КОГДА ЦеныНоменклатуры.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
			|		ТОГДА СправНоменклатура.ЕдиницаИзмерения
			|	ИНАЧЕ ЦеныНоменклатуры.Упаковка
			|КОНЕЦ)",
			"ЦеныНоменклатуры.Номенклатура"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.Параметры.Вставить("УчетнаяЗапись",  ДанныеУчетнойЗаписи.УчетнаяЗапись);
	Запрос.Параметры.Вставить("ВидЦен",         ДанныеУчетнойЗаписи.ЦенаПродажи);
	Запрос.УстановитьПараметр("ДатаЦен",        ТекущаяДата);
	Запрос.УстановитьПараметр("БазоваяВалюта",  ЗначениеНастроекПовтИсп.БазоваяВалютаПоУмолчанию());
	Запрос.УстановитьПараметр("Номенклатура",	Запись.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика",	Запись.Характеристика);
	Запрос.УстановитьПараметр("Упаковка",		Запись.Упаковка);
	
	ЦеныТоваров = Запрос.Выполнить().Выгрузить();
	
	Если ЦеныТоваров.Количество()>0 Тогда	
		Цена = ЦеныТоваров[0].Цена;
	Иначе
		Цена = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДопИнфо()
	
	Если Запись.ТоварнаяКатегория <> "" Тогда
		ШаблонСообщения = НСтр("ru = 'Категория: %1'") + Символы.ПС;
		ТоварнаяКатегория = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, Запись.ТоварнаяКатегория);
	Иначе
		ТоварнаяКатегория = НСтр("ru = 'Категория: не указана'") + Символы.ПС;
	КонецЕсли;

	Если Запись.ЦенаПродажи <> "" Тогда
		ШаблонСообщения = НСтр("ru = 'Цена продажи: %1'") + Символы.ПС;
		БазоваяЦена = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, Запись.ЦенаПродажи);
	Иначе
		БазоваяЦена = НСтр("ru = 'Цена продажи: не указана'") + Символы.ПС;
	КонецЕсли;
	
	РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Запись.Номенклатура, 
		"Наименование, Артикул, Марка, Марка.Наименование, Производитель, Производитель.Наименование, "
			+ "СтранаПроисхождения, СтранаПроисхождения.Наименование, СрокГодности, ЕдиницаИзмеренияСрокаГодности");
	
	Если ЗначениеЗаполнено(РеквизитыНоменклатуры.Марка) Тогда
		ШаблонСообщения = НСтр("ru = 'Бренд (марка): %1'") + Символы.ПС;
		Бренд = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, РеквизитыНоменклатуры.МаркаНаименование);
	Иначе
		Бренд = НСтр("ru = 'Бренд (марка): не указан'") + Символы.ПС;
	КонецЕсли;

	Если РеквизитыНоменклатуры.Артикул <> "" Тогда
		ШаблонСообщения = НСтр("ru = 'Артикул: %1'") + Символы.ПС;
		Артикул = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, РеквизитыНоменклатуры.Артикул);
	Иначе
		Артикул = НСтр("ru = 'Артикул: не указан'") + Символы.ПС;
	КонецЕсли;

	Если ЗначениеЗаполнено(РеквизитыНоменклатуры.Производитель) Тогда 
		ШаблонСообщения = НСтр("ru = 'Производитель: %1'") + Символы.ПС;
		Производитель = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, РеквизитыНоменклатуры.ПроизводительНаименование);
	Иначе
		Производитель  = НСтр("ru = 'Производитель: не указан (обязателен при отправке на модерацию)'") + Символы.ПС;
	КонецЕсли;

	Если ЗначениеЗаполнено(РеквизитыНоменклатуры.СтранаПроисхождения) Тогда
		ШаблонСообщения = НСтр("ru = 'Страна происхождения: %1'") + Символы.ПС;
		Страна = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, РеквизитыНоменклатуры.СтранаПроисхожденияНаименование);
	Иначе
		Страна = НСтр("ru = 'Страна происхождения: не указана (обязательна при отправке на модерацию)'") + Символы.ПС;
	КонецЕсли;

	Если ЗначениеЗаполнено(РеквизитыНоменклатуры.СрокГодности) Тогда
		ШаблонСообщения = НСтр("ru = 'Срок годности: %1 %2'") + Символы.ПС;
		СрокГодности = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, 
			РеквизитыНоменклатуры.СрокГодности, 
			РеквизитыНоменклатуры.ЕдиницаИзмеренияСрокаГодности);
	Иначе
		СрокГодности  = НСтр("ru = 'Срок годности: не указан'") + Символы.ПС;
	КонецЕсли;
	
	ЕстьШтрихКоды = ИнтеграцияСЯндексМаркетСервер.ПолучитьШтрихКоды(Запись.Номенклатура, Запись.Характеристика, Запись.Упаковка).Количество()>0;

	Если ЕстьШтрихКоды Тогда
		ШтрихКоды = НСтр("ru = 'Для товара указаны штрих-коды'") + Символы.ПС;
	Иначе
		ШтрихКоды = НСтр("ru = 'Для товара не указаны штрих-коды (обязательны при отправке на модерацию)'") + Символы.ПС;
	КонецЕсли;

	Весогабариты = ИнтеграцияСЯндексМаркетСервер.ПолучитьВесогабариты(Запись.Упаковка, Запись.Номенклатура, Истина);

	ВесогабаритыЗаголовок = НСтр("ru = 'Весогабариты:'") + Символы.ПС;
	Если Весогабариты.length <> "" Тогда
		Если Весогабариты.package = 1 Тогда
			ШаблонСообщения = НСтр("ru = '	Длина (глубина) упаковки товара: %1 см'") + Символы.ПС;
		Иначе
			ШаблонСообщения = НСтр("ru = '	Длина: %1 см'") + Символы.ПС;
		КонецЕсли;
		ВесогабаритыДлина = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, Весогабариты.length);
	Иначе
		Если Весогабариты.package = 1 Тогда
			ВесогабаритыДлина = НСтр("ru = '	Для товара не указана длина (глубина) в параметрах упаковки (обязательный параметр при отправке на модерацию)'") + Символы.ПС;
		Иначе
			ВесогабаритыДлина = НСтр("ru = '	Для товара не указана длина (обязательный параметр при отправке на модерацию)'") + Символы.ПС;
		КонецЕсли;
	КонецЕсли;

	Если Весогабариты.width <> "" Тогда
		Если Весогабариты.package = 1 Тогда
			ШаблонСообщения = НСтр("ru = '	Ширина упаковки товара: %1 см'") + Символы.ПС;
		Иначе
			ШаблонСообщения = НСтр("ru = '	Ширина: %1 см'") + Символы.ПС;
		КонецЕсли;
		ВесогабаритыШирина = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, Весогабариты.width);
	Иначе
		Если Весогабариты.package = 1 Тогда
			ВесогабаритыШирина = НСтр("ru = '	Для товара не указана ширина в параметрах упаковки (обязательный параметр при отправке на модерацию)'") + Символы.ПС;
		Иначе
			ВесогабаритыШирина = НСтр("ru = '	Для товара не указана ширина (обязательный параметр при отправке на модерацию)'") + Символы.ПС;
		КонецЕсли;
	КонецЕсли;

	Если Весогабариты.height <> "" Тогда
		Если Весогабариты.package = 1 Тогда
			ШаблонСообщения = НСтр("ru = '	Высота упаковки товара: %1 см'") + Символы.ПС;
		Иначе
			ШаблонСообщения = НСтр("ru = '	Высота: %1 см'") + Символы.ПС;
		КонецЕсли;

		ВесогабаритыВысота = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, Весогабариты.height);
	Иначе
		Если Весогабариты.package = 1 Тогда
			ВесогабаритыВысота = НСтр("ru = '	Для товара не указана высота в параметрах упаковки (обязательный параметр при отправке на модерацию)'") + Символы.ПС;
		Иначе 
			ВесогабаритыВысота = НСтр("ru = '	Для товара не указана высота (обязательный параметр при отправке на модерацию)'") + Символы.ПС;
		КонецЕсли;
	КонецЕсли;

	Если Весогабариты.weight <> "" Тогда
		Если Весогабариты.package = 1 Тогда
			ШаблонСообщения = НСтр("ru = '	Вес упаковки товара: %1 кг'") + Символы.ПС;
		Иначе
			ШаблонСообщения = НСтр("ru = '	Вес: %1 кг'") + Символы.ПС;
		КонецЕсли;

		ВесогабаритыВес = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, Весогабариты.weight);
	Иначе
		Если Весогабариты.package = 1 Тогда
			ВесогабаритыВес = НСтр("ru = '	Для товара не указан вес в параметрах упаковки (обязательный параметр при отправке на модерацию)'") + Символы.ПС;
		Иначе
			ВесогабаритыВес = НСтр("ru = '	Для товара не указан вес (обязательный параметр при отправке на модерацию)'") + Символы.ПС;
		КонецЕсли;

	КонецЕсли;

	ДопИнфо = ТоварнаяКатегория + БазоваяЦена + Бренд + Артикул + Производитель
		+ Страна + ШтрихКоды + СрокГодности + ВесогабаритыЗаголовок+ ВесогабаритыДлина
		+ ВесогабаритыШирина + ВесогабаритыВысота + ВесогабаритыВес;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаписьСуществует(СтруктураЗаписи)

	ЗаписьСуществует = Ложь;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СтатусыПубликацииТоваровЯндексМаркет.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.СтатусыПубликацииТоваровЯндексМаркет КАК СтатусыПубликацииТоваровЯндексМаркет
		|ГДЕ
		|	СтатусыПубликацииТоваровЯндексМаркет.УчетнаяЗапись = &УчетнаяЗапись
		|	И СтатусыПубликацииТоваровЯндексМаркет.Номенклатура = &Номенклатура
		|	И СтатусыПубликацииТоваровЯндексМаркет.Характеристика = &Характеристика
		|	И СтатусыПубликацииТоваровЯндексМаркет.Упаковка = &Упаковка";

	Запрос.Параметры.Вставить("УчетнаяЗапись",  СтруктураЗаписи.УчетнаяЗапись);
	Запрос.Параметры.Вставить("Номенклатура",   СтруктураЗаписи.Номенклатура);
	Запрос.Параметры.Вставить("Характеристика", СтруктураЗаписи.Характеристика);
	Запрос.Параметры.Вставить("Упаковка",       СтруктураЗаписи.Упаковка);

	ВыборкаДанных = Запрос.Выполнить().Выбрать();

	Если ВыборкаДанных.Следующий() Тогда
		ЗаписьСуществует = Истина;
	КонецЕсли;

	Возврат ЗаписьСуществует;

КонецФункции

&НаКлиенте
Асинх Функция СкопироватьВБуферОбмена(Текст)
	
	Если СредстваБуфераОбмена.ИспользованиеДоступно() Тогда
		ФорматДанных = СтандартныйФорматДанныхБуфераОбмена.Текст;
		
		Если Ждать СредстваБуфераОбмена.ПоддерживаетсяФорматДанных(ФорматДанных) Тогда
			ПомещаемыеДанные = Новый ЭлементБуфераОбмена(ФорматДанных, Текст);
			Возврат Ждать СредстваБуфераОбмена.ПоместитьДанныеАсинх(ПомещаемыеДанные);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ИдентификаторПредложенияНеУникален(ИдентификаторПредложения)
	
	Результат = Новый Структура();
	Результат.Вставить("ИдентификаторПредложенияНеУникален",Ложь);
	Результат.Вставить("УчетнаяЗапись");
	Результат.Вставить("ПредставлениеТовара");
	ИдентификаторКабинета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.УчетнаяЗапись,"ИдентификаторКабинета");
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("ИдентификаторПредложения", СокрЛП(ИдентификаторПредложения));  
    Запрос.Параметры.Вставить("ИдентификаторКабинета",ИдентификаторКабинета);
	Запрос.Параметры.Вставить("УчетнаяЗапись", Запись.УчетнаяЗапись);  
	Запрос.Параметры.Вставить("Номенклатура", Запись.Номенклатура);
	Запрос.Параметры.Вставить("Характеристика", Запись.Характеристика);
	Запрос.Параметры.Вставить("Упаковка", Запись.Упаковка);
	
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СтатусыПубликацииТоваровЯндексМаркет.УчетнаяЗапись КАК УчетнаяЗапись,
		|	СтатусыПубликацииТоваровЯндексМаркет.ПредставлениеТовара КАК ПредставлениеТовара
		|ИЗ
		|	РегистрСведений.СтатусыПубликацииТоваровЯндексМаркет КАК СтатусыПубликацииТоваровЯндексМаркет
		|ГДЕ
		|	СтатусыПубликацииТоваровЯндексМаркет.УчетнаяЗапись.ИдентификаторКабинета = &ИдентификаторКабинета
		|	И СтатусыПубликацииТоваровЯндексМаркет.ИдентификаторПредложения = &ИдентификаторПредложения
		|	И (НЕ (СтатусыПубликацииТоваровЯндексМаркет.Номенклатура = &Номенклатура 
		|		  И СтатусыПубликацииТоваровЯндексМаркет.Характеристика = &Характеристика
		|		  И СтатусыПубликацииТоваровЯндексМаркет.Упаковка = &Упаковка)
		|		ИЛИ 
		|		НЕ (СтатусыПубликацииТоваровЯндексМаркет.УчетнаяЗапись = &УчетнаяЗапись))";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Результат.ИдентификаторПредложенияНеУникален = Истина; 
		Результат.УчетнаяЗапись = РезультатЗапроса.УчетнаяЗапись;	
		Результат.ПредставлениеТовара = РезультатЗапроса.ПредставлениеТовара;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаСервере
Процедура ЗаполнитьСвойстваЗаписи()
	
	Номенклатура        = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Запись.Номенклатура, "Наименование");
	Характеристика      = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Запись.Характеристика, "Наименование");
	Упаковка            = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Запись.Упаковка, "Наименование");
	ПредставлениеТовара = Номенклатура.Наименование;
	Если ЗначениеЗаполнено(Характеристика.Наименование) Тогда
		ПредставлениеТовара = ПредставлениеТовара + ", " + Характеристика.Наименование;
	КонецЕсли;
	Если ЗначениеЗаполнено(Упаковка.Наименование) Тогда
		ПредставлениеТовара = ПредставлениеТовара + ", " + Упаковка.Наименование;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.Статус) Тогда 
		Запись.Статус = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.УтвержденаРекомендация;
	КонецЕсли;
	Запись.ТоварнаяКатегория   = ИнтеграцияСЯндексМаркетСервер.КатегорияТовара(Запись.Номенклатура,Запись.УчетнаяЗапись);
	Запись.ПредставлениеТовара = ПредставлениеТовара; 
	
КонецПроцедуры

#КонецОбласти
